app/views/carts/_cart.html.haml

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT 1  [["cart_id", 16]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 3]]
---

- unless cart.line_items.empty?
  .cart_title Your Cart