app/controllers/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY "products"."name" ASC
---
  def index
    byebug
    puts "======================================================================================="
    if params[:search].present?
      @products = Product.search(params[:name])

INSERT INTO "products" ("name", "image", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sách "], ["image", "sách"], ["price", 1], ["description", "sách mơi"], ["created_at", "2015-05-31 05:30:02.389026"], ["updated_at", "2015-05-31 05:30:02.389026"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", 0], ["updated_at", "2015-05-31 07:20:34.746732"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)